Tekla Open API Reference for Tekla Structures 2025
BoltGroup.BoltStandard Property
 The standard of the bolt group.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string BoltStandard { get; set; }
Public Property BoltStandard As String
	Get
	Set
Property Value
Type: String
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace